# MepEquipmentClassification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepEquipmentClassification Property
ParameterTypeId Class See Also
---
"Classification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepEquipmentClassification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepEquipmentClassification As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepEquipmentClassification {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace